package crawler

import "fmt"

import "net/http"
import "github.com/PuerkitoBio/goquery"
import "strings"
import "github.com/Jeffail/gabs"

var courseList = []string{"English for Career Development", "The Science of Harry Potter", "西方文学与思想名篇讲读：人类与非人类世界专题", "应用地球物理学II（重磁电探测方法及测井）", "毛泽东思想和中国特色社会主义理论体系概论", "毛泽东思想和中国特色社会主义理论体系概论", "SUSTech English III", "SUSTech English II", "TOEFL Preparation", "应用地球物理学I （地震勘探原理）", "SUSTech English I", "个体与社会: 一个社会学的分析视角", "应用数学选讲：凸优化的一阶分裂算法", "现代电子科学与技术前沿讲座II", "现代电子科学与技术前沿讲座IV", "现代材料科学与技术前沿讲座II", "计算机科学与技术前沿讲座 IV", "集成电路前沿-机器学习芯片设计", "计算机科学与技术前沿讲座II", "金属材料粉末冶金及其3D打印", "生物信息学在环境科学中的应用", "永乐宫壁画与中国传统绘画色彩", "生物科学前沿讲座与文献综述", "理解死亡：哲学、社会与文化", "工程材料—科学、工艺与设计", "《孙子兵法》与中国兵学文化", "广义相对论：从黑洞到宇宙学", "cubase软件运用与创编", "固体废弃物处理处置与资源化", "微纳合成、技术与应用实验", "生物化学II（新陈代谢）", "污染物环境行为与风险评估", "高级植物生物学前沿与交叉", "环境科学与工程实验（二）", "微纳装备技术与嵌入式系统", "生物化学与分子生物学实验", "电化学能源工程技术研究I", "计算机科学创新实验II", "金融与创业前沿论坛II", "金融数据分析与数据挖掘", "材料科学创新实验III", "思想道德修养与法律基础", "新媒体艺术空间设计基础", "生物医学工程实验（二）", "生理学与病理生理学II", "工业产品解剖与改造实践", "宋代院体工笔花鸟画临习", "功率器件和开关电源设计", "高等工程热力学与动力学", "马克思主义基本原理概论", "思想道德修养与法律基础", "先进复合材料原理与应用", "木构建筑：从远古到未来", "机器人技术及嵌入式系统", "数学英语写作（研究生）", "微显示技术与AR/VR", "计算机系统设计及应用A", "丝绸之路文化交流史概论", "化学动力学和动态学 I", "微波电磁场前沿课题选讲", "生物医学工程创新实践Ⅰ", "世界建筑：史前到巴洛克", "产品创新与设计开发方法", "电子科学创新实验II", "模式生物和发育生物学", "材料科学创新实验II", "计算机程序设计基础B", "计算机程序设计基础A", "电源管理集成电路设计", "诗词格律与古诗词写作", "科学计算与计算机编程", "数据科学中的统计学习", "专用集成电路设计技术", "金属增材制造理论基础", "技术型创业基础与实战", "MATLAB程序设计", "高级仪器系统的研发I", "X-射线单晶结构解析", "中国考古学与艺术简介", "表界面科学与分析技术", "当代建筑的纪实与传播", "MATLAB工程应用", "人文名家专题系列课程", "高级实验训练（生物）", "乡土世界：乡村人类学", "DSP系统设计与仿真", "纳米材料合成与技术", "数据结构与算法分析", "光纤通信原理与技术", "科幻电影鉴赏与批评", "艺术设计的绘图表达", "泛函分析（研究生）", "热力学与统计物理I", "马克思主义基本原理", "材料科学创新实验I", "材料学综合实验II", "数学分析II(H)", "创新设计理论与实践", "干细胞与再生生物学", "创新科研实践 II", "金融工程理论实践课", "大学物理 B(上)", "等离子体原理与应用", "冷冻电子显微学概论", "地球与空间科学导论", "大学物理 C(下)", "影视拍摄与编辑基础", "岭南文化与岭南方言", "消费文化与当代社会", "全球生物多样性保护", "数据结构与金融应用", "金融科技案例分析I", "无线网络与移动计算", "科研创新项目III", "矿物学与岩石学实验", "C/C++程序设计", "信号分析与数据处理", "文献综述与内容分析", "大学物理 B(下)", "微能源与微系统前沿", "衍生证券模型与定价", "生物医学工程（二）", "常微分方程A(H)", "高等代数II(H)", "测试与检测技术基础", "毕业论文（设计）", "光电器件工艺实践", "毕业论文（设计）", "概率论与数理统计", "偏微分方程数值解", "毕业论文（设计）", "蛋白质结构与功能", "半导体材料与器件", "毕业论文（设计）", "金融实证分析方法", "毕业论文（设计）", "现代物理技术实验", "毕业论文（设计）", "中国近现代史纲要", "集成电路工艺实践", "材料测试分析技术", "光伏光热技术导论", "先进材料表征技术", "半导体物理与器件", "科技创新项目II", "纳米生物医学概论", "艺术与科学大讲堂", "大学物理A(下)", "国际学术会议英语", "精益六西格玛设计", "演化计算及其应用", "毕业论文（设计）", "中外文化记忆研究", "国际学术会议英语", "当代中国城市问题", "连续介质力学基础", "中国近现代史纲要", "CAD与工程制图", "动力学与机械振动", "微电子材料与工艺", "地球物理反演理论", "毕业论文（设计）", "高等数学（上）A", "实验室轮转III", "水资源评价与管理", "近现代日本文化史", "高等数学（下）A", "定量生理学（二）", "通信芯片系统设计", "光谱学与光谱技术", "科研创新项目II", "生成式新媒体设计", "生物医学综合实验", "医学影像系统实验", "航空结构强度实验", "水文学原理与应用", "海洋微生物学实验", "偏微分方程数值解", "分子微生物学实验", "高等连续介质力学", "毕业论文（设计）", "文物精品研究鉴赏", "毕业论文（设计）", "制造工程认知实践", "生物医学光学实验", "水利水电工程概论", "高级地下水水文学", "生物医学工程概论", "创新教学实践II", "计算机组成原理", "计算机操作系统", "半导体器件导论", "工程电磁场理论", "微机电系统基础", "通信系统设计I", "普通生物学实验", "BME前沿技术", "细胞与组织工程", "基础汉语 II", "水力学基础实验", "天然产物全合成", "气候变化经济学", "大气污染与防治", "数学分析III", "科研创新项目I", "计算海洋学基础", "协作机器人学习", "嗓音肌理及运用", "微加工与微系统", "创新创业大讲堂", "商务大数据分析", "理论力学 II", "乐理与视唱练耳", "线性代数I-B", "复变函数(H)", "休闲文化与产业", "中外戏剧与性别", "实验室轮转II", "线性代数I-A", "整合与创新设计", "机器人操作系统", "高等地球电磁学", "化学原理实验A", "高等弹性动力学", "生物医学伦理学", "矿物学与岩石学", "偏微分方程专题", "抽象代数(H)", "算法设计与分析", "人格塑造十五讲", "半导体存储技术", "俄罗斯音乐赏析", "高级细胞生物学", "有机与生物材料", "创业思维与实践", "古典音乐零距离", "有机化学II", "无机化学实验", "物理化学II", "有机波谱解析", "生物无机化学", "集成电路设计", "科研创新项目", "金融投资概论", "多元统计分析", "固定收益产品", "有机化学实验", "化学前沿研究", "线性代数II", "艺术造型初步", "材料科学进展", "物理化学实验", "科技创新项目", "固体光电子学", "电动力学II", "科研创新项目", "现代生物技术", "现代生物技术", "计算机图形学", "生命科学概论", "材料基因组学", "数字系统设计", "多相流体力学", "仪器分析实践", "机械设计基础", "高等应用数学", "传感器与应用", "材料力学行为", "常微分方程B", "仪器分析原理", "先进制造实践", "生物医学成像", "微生物海洋学", "金融数学基础", "创新设计实践", "高等固体物理", "柔性电子材料", "数理金融基础", "模拟电路实验", "金属有机化学", "数学物理方法", "中级汉语II", "大分子自组装", "科研创新项目", "计算流体力学", "地下水水文学", "控制工程基础", "化学前沿实践", "有机人名反应", "中国审美哲学", "常微分方程A", "并行与云计算", "中国区域民歌", "广义线性模型", "力电耦合原理", "高等材料化学", "高等质谱分析", "市场营销管理", "数值计算方法", "材料科学基础", "金融风险管理", "应用随机过程", "科学实践训练", "能源工程基础", "高级汉语II", "有机波谱解析", "中国传统线描", "金融信息系统", "统计机器学习", "数学分析II", "中国戏曲美学", "语音信号处理", "地球科学概论", "高等数值分析", "流体力学实验", "计算固体力学", "化学原理 B", "机械制造基础", "环境监测实验", "数学分析精讲", "量子输运理论", "艺术实践课Ⅱ", "基础物理实验", "物理有机化学", "地球物理实验", "化学原理 A", "海洋科学趣谈", "机械工程导论", "智能数据分析", "海洋科学导论", "数字图像处理", "先进制造系统", "综合物理实验", "生物医学光学", "高级优化算法", "应用量子力学", "基础有机化学", "大气科学导论", "运动生物力学", "数字电路实验", "艺术实践课Ⅰ", "形势与政策", "固态电子学", "信号和系统", "宏观经济学", "微观经济学", "金融衍生品", "遗传学实验", "系统生物学", "生物信息学", "神经生物学", "不对称合成", "高分子材料", "能源材料学", "环境学导论", "货币银行学", "金融经济学", "金融经济学", "原子物理学", "低温物理学", "量子力学I", "电动力学I", "分子生物学", "机器人基础", "媒体与社会", "普通生物学", "蛋白质工程", "计算材料学", "智能机器人", "光电子导论", "形势与政策", "地质学原理", "高分子化学", "海洋地质学", "飞行器原理", "想象力入门", "西方音乐史", "微生物技术", "机器人导论", "化学海洋学", "综合生物学", "环境材料学", "海洋沉积学", "高等拓扑学", "物理海洋学", "技术创新史", "传播与科技", "生物信息学", "朗读与演讲", "非参数统计", "贝叶斯统计", "行走机器人", "身体与情感", "全球化概论", "综合设计Ⅱ", "数据库原理", "设计思维学", "大数据导论", "傅里叶分析", "解剖学导论", "纳米材料学", "超分子化学", "医术与社会", "有机电子学", "工程师道德", "物联网技术", "微型机器人", "写作与交流", "地球动力学", "实验语音学", "审美的历程", "计量经济学", "分子药理学", "离散数学", "软件工程", "电路基础", "通信原理", "激光原理", "微波工程", "工业实习", "复变函数", "公司金融", "财务会计", "抽象代数", "微生物学", "化工原理", "材料力学", "环境化学", "体育II", "体育IV", "沟通技巧", "数理统计", "激光原理", "材料物理", "生物材料", "分析力学", "表面物理", "配位化学", "工业实习", "艺术鉴赏", "环境监测", "光学基础", "物理化学", "社会实践", "抽样调查", "中国文化", "寿险精算", "随机分析", "数字电路", "即兴创编", "创新创业", "毕业论文", "计算方法", "体态律动", "模拟电路", "数学建模", "组合数学", "公共演讲", "中国历史", "材料化学", "美术鉴赏", "微分几何", "遥感原理", "固体理论", "材料力学", "科幻创作", "美国文化", "工笔花鸟", "代数图论", "界面现象", "毕业设计", "设计工程", "量子计算", "数据挖掘", "晶体化学", "毕业论文", "数字逻辑", "疼痛医学", "深度学习", "商业银行", "断裂力学", "城市研究", "地球历史", "工程伦理", "毕业论文", "走进非洲", "工业实习", "创业管理", "朗诵艺术", "泛函分析", "喷气推进", "弹性力学", "模式识别", "遗传学", "心理学", "水力学", "病理学", "EAP", "土壤学", "运筹学", "传热学", "湍流", "篮球"}

func GetAllCourse(username string, password string) string {
	client := Login(username, password)
	jsonObj := gabs.New()
	if client == nil {
		jsonObj.Set(false, "state")
		return jsonObj.String()
	}

	req, _ := http.NewRequest("POST", "http://jwxt.sustech.edu.cn/jsxsd/xskb/xskb_list.do", strings.NewReader(""))
	resp, err := client.Do(req)
	if err != nil {
		fmt.Println(err)

	}
	defer resp.Body.Close()

	doc, err := goquery.NewDocumentFromReader(resp.Body)

	table := doc.Find("#kbtable")

	res := make([]string, 0)
	table.Find("div.kbcontent1").Each(func(i int, selection *goquery.Selection) {
		temp := selection.Text()
		for _, course := range courseList {
			if index := strings.Index(temp, course); index > -1 {
				flag := true
				for _, item := range res {
					if item == course {
						flag = false
						break
					}
				}
				if flag {
					res = append(res, course)
				}
			}
		}
	})

	jsonObj.Array("courses")
	for _, course := range res {
		jsonObj.ArrayAppend(course, "courses")
	}
	jsonObj.Set(true, "state")

	return jsonObj.String()
}
